Core/src/Documents/ТаможенноеОформление/ТаможенноеОформление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможенноеОформление</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИмпорта</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходовНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitNetWeight</name>
      <comment>Unit net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitGrossWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountNet</name>
      <comment>Amount net</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountGross</name>
      <comment>Amount gross</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductOur</name>
      <comment>Cost of The Product Our</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductRSge</name>
      <comment>Cost of The Product RS.ge</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByProgram</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByCustoms</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/ТаможенноеОформление/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ОбработчикЗаполнения";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);

	ЭтотОбъект.Ответственный = ЭтотОбъект.Автор;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ТаможенноеОформление.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьСебестоимостьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура РаспределитьСуммуНДСПоСуммеНДС() Экспорт

	ИсхСуммаНДС = 0;
	БазаРаспределенияСумма = Запасы.Итог("Сумма");
	ВсегоНДСРасходы = СуммаНДС;
	
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.Сумма / БазаРаспределенияСумма, 2, 1),0);
		БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Сумма;
		ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		
	КонецЦикла;	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СуммаНДС <> Запасы.Итог("СуммаРасходовНДС") Тогда 
		
		ТекстСообщения = НСтр("ka='მომსახურებების ჯამი მარაგებზე განაწილებული ჯამის ტოლი არ არის!';ru='Сумма НДС услуг не равна распределенной сумме по запасам!';en='VAT service amount is not equal to the amount distributed in reserves!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяТабличнойЧасти(ДанныеЗаполнения)) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ЗапросДанныхДляЗаполнения(ДанныеЗаполнения).Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
		
	ЭтотОбъект.Запасы.Очистить();
	ВыборкаТабличнаяЧасть = ВыборкаШапка[ИмяТабличнойЧасти(ДанныеЗаполнения)].Выбрать();
	Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
		НовСтрок = ЭтотОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрок, ВыборкаТабличнаяЧасть);
		НовСтрок.ДокументПоступления = ДанныеЗаполнения;
		НовСтрок.СтавкаНДС = НовСтрок.Номенклатура.СтавкаНДС;		
	КонецЦикла;
	
	РассчитатьТаблицы(ИСТИНА);
	
КонецПроцедуры

Функция ИмяТабличнойЧасти(ДанныеЗаполнения)
	
	ИменаТабличныхЧастей = Новый Соответствие;
	ИменаТабличныхЧастей[Тип("ДокументСсылка.ПриходнаяНакладная")] = "Запасы";
	
	Возврат ИменаТабличныхЧастей[ТипЗнч(ДанныеЗаполнения)];
	
КонецФункции

Функция ЗапросДанныхДляЗаполнения(ДанныеЗаполнения)
	
	Конструктор = Новый СхемаЗапроса;
	Пакет = Конструктор.ПакетЗапросов[0];
	Пакет.ВыбиратьРазрешенные = Истина;
	Оператор0 = Пакет.Операторы[0];
	Оператор0.Источники.Добавить(ДанныеЗаполнения.Метаданные().ПолноеИмя());
	Для Каждого ОписаниеПоляШапки Из ОписаниеПолейШапки(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(ОписаниеПоляШапки.Ключ);
		Если ЗначениеЗаполнено(ОписаниеПоляШапки.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ОписаниеПоляШапки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекОписаниеПоляТабличнойЧастиЗапасы Из ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.%2",
		ИмяТабличнойЧасти(ДанныеЗаполнения),
		ТекОписаниеПоляТабличнойЧастиЗапасы.Ключ));
		Если ЗначениеЗаполнено(ТекОписаниеПоляТабличнойЧастиЗапасы.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ТекОписаниеПоляТабличнойЧастиЗапасы.Значение;
		КонецЕсли;
	КонецЦикла;
			
	Оператор0.Отбор.Добавить("Ссылка = &Параметр");
	
	Результат = Новый Запрос(Конструктор.ПолучитьТекстЗапроса());
	Результат.УстановитьПараметр("Параметр", ДанныеЗаполнения);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПолейШапки(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	
	ДанныеЗаполненияМетаданные = ДанныеЗаполнения.Метаданные();
	
	Результат.Вставить("Ссылка", "ДокументОснование");
	Результат.Вставить("Организация");
	Результат.Вставить("Организация.БанковскийСчетПоУмолчанию", "БанковскийСчет");
	
		
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРеквизитЕслиОнЕстьВДокументе(РезультатСоответствие, ДанныеЗаполненияМетаданные, ИмяРеквизита)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, ДанныеЗаполненияМетаданные) Тогда
		РезультатСоответствие.Вставить(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	//Результат.Вставить("ДокументПоступления");
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Количество");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("Цена");
	Результат.Вставить("Сумма");
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СуммаРасходовНДС");
	
	
	Возврат Результат;
	
КонецФункции

Процедура РассчитатьТаблицы(ПереустановитьТНВЭД=ИСТИНА) ЭКСПОРТ
	
	Для каждого СтрЗапасы Из Запасы Цикл
		
		Если ПереустановитьТНВЭД Тогда
			СтрЗапасы.ТоварнаяНоменклатураВЭД = СтрЗапасы.Номенклатура.ТоварнаяНоменклатураВЭД;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗапасы.ТоварнаяНоменклатураВЭД) Тогда
		
			Если ТипЗНЧ(СтрЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			    ТекКоличество = СтрЗапасы.Количество * СтрЗапасы.ЕдиницаИзмерения.Коэффициент;
			Иначе
				ТекКоличество = СтрЗапасы.Количество;
			КонецЕсли;
			
			СтрЗапасы.UnitNetWeight = СтрЗапасы.Номенклатура.ВесНетто;
			СтрЗапасы.UnitGrossWeight = СтрЗапасы.Номенклатура.Вес;
			
			СтрЗапасы.AmountNet = ТекКоличество * СтрЗапасы.UnitNetWeight;
			СтрЗапасы.AmountGross = ТекКоличество * СтрЗапасы.UnitGrossWeight;
			
			СтрЗапасы.PerNetWeight = СтрЗапасы.AmountNet * СтрЗапасы.ТоварнаяНоменклатураВЭД.PerNetWeight;
			СтрЗапасы.PerGrossWeight = СтрЗапасы.AmountGross * СтрЗапасы.ТоварнаяНоменклатураВЭД.PerGrossWeight;
			
			СтрЗапасы.PerPiece = ТекКоличество * СтрЗапасы.ТоварнаяНоменклатураВЭД.PerPiece;
			СтрЗапасы.PercentOnPrice = СтрЗапасы.Сумма * СтрЗапасы.ТоварнаяНоменклатураВЭД.PercentOnPrice / 100;
		
		КонецЕсли;
	
	КонецЦикла;
	
	ТЗ_HS_Codes = Запасы.Выгрузить(,"ТоварнаяНоменклатураВЭД,PerNetWeight,PerGrossWeight,PerPiece,PercentOnPrice");
	ТЗ_HS_Codes.Свернуть("ТоварнаяНоменклатураВЭД","PerNetWeight,PerGrossWeight,PerPiece,PercentOnPrice");
	
	CalculatedByProgram.Загрузить(ТЗ_HS_Codes);
	Для каждого СтрТЗ_HS_Codes Из ТЗ_HS_Codes Цикл
	
		СтрCalculatedByCustoms = CalculatedByCustoms.Найти(СтрТЗ_HS_Codes.ТоварнаяНоменклатураВЭД,"ТоварнаяНоменклатураВЭД");
		Если СтрCalculatedByCustoms = НЕОПРЕДЕЛЕНО Тогда
			СтрCalculatedByCustoms = CalculatedByCustoms.Добавить();
			ЗаполнитьЗначенияСвойств(СтрCalculatedByCustoms,СтрТЗ_HS_Codes);
		КонецЕсли;
	
	КонецЦикла; 
	
	Для каждого СтрЗапасы Из Запасы Цикл
	
		РассчитатьПоСтрокеCostOfTheProduct(СтрЗапасы.НомерСтроки);
	
	КонецЦикла;
КонецПроцедуры

Процедура РассчитатьПоСтрокеCostOfTheProduct(СтрЗапасыНомерСтроки) ЭКСПОРТ

	СтрЗапасы = Запасы.Найти(СтрЗапасыНомерСтроки, "НомерСтроки");
	Если НЕ СтрЗапасы = НЕОПРЕДЕЛЕНО Тогда
	
		Если ЗначениеЗаполнено(СтрЗапасы.ТоварнаяНоменклатураВЭД) Тогда
			
			ТЗ_Отбор = Запасы.Выгрузить(Новый Структура("ТоварнаяНоменклатураВЭД", СтрЗапасы.ТоварнаяНоменклатураВЭД));
			
			ИтогPerNetWeight = ТЗ_Отбор.Итог("PerNetWeight");
			Если ИтогPerNetWeight>0 Тогда
				PerNetWeightForDistribution = СтрЗапасы.PerNetWeight / ИтогPerNetWeight;
			Иначе
				PerNetWeightForDistribution = 0;
			КонецЕсли;
			
			ИтогPerGrossWeight = ТЗ_Отбор.Итог("PerGrossWeight");
			Если ИтогPerGrossWeight>0 Тогда
				PerGrossWeightForDistribution = СтрЗапасы.PerGrossWeight / ИтогPerGrossWeight;
			Иначе
				PerGrossWeightForDistribution = 0;
			КонецЕсли;
			
			ИтогPerPiece = ТЗ_Отбор.Итог("PerPiece");
			Если ИтогPerPiece>0 Тогда
				PerPieceForDistribution = СтрЗапасы.PerPiece / ИтогPerPiece;
			Иначе
				PerPieceForDistribution = 0;
			КонецЕсли;
			
			ИтогPercentOnPrice = ТЗ_Отбор.Итог("PercentOnPrice");
			Если ИтогPercentOnPrice>0 Тогда
				PercentOnPriceForDistribution = СтрЗапасы.PercentOnPrice / ИтогPercentOnPrice;
			Иначе
				PercentOnPriceForDistribution = 0;
			КонецЕсли;
			
			СтрCalculatedByCustoms = CalculatedByCustoms.Найти(СтрЗапасы.ТоварнаяНоменклатураВЭД,"ТоварнаяНоменклатураВЭД");
			Если НЕ СтрCalculatedByCustoms = НЕОПРЕДЕЛЕНО Тогда
			
				PerNetWeightReAllocation = PerNetWeightForDistribution * СтрCalculatedByCustoms.PerNetWeight;
				PerGrossWeightReAllocation = PerGrossWeightForDistribution * СтрCalculatedByCustoms.PerGrossWeight;
				PerPieceReAllocation = PerPieceForDistribution * СтрCalculatedByCustoms.PerPiece;
				PercentOnPriceReAllocation = PercentOnPriceForDistribution * СтрCalculatedByCustoms.PercentOnPrice;
				
				Если ТипЗНЧ(СтрЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
					ТекКоличество = СтрЗапасы.Количество * СтрЗапасы.ЕдиницаИзмерения.Коэффициент;
				Иначе
					ТекКоличество = СтрЗапасы.Количество;
				КонецЕсли;
				
				Если ТекКоличество>0 Тогда
					СтрЗапасы.CostOfTheProductOur = (СтрЗапасы.Сумма + СтрЗапасы.PerNetWeight + СтрЗапасы.PerGrossWeight + СтрЗапасы.PerPiece + СтрЗапасы.PercentOnPrice) / ТекКоличество;
					СтрЗапасы.CostOfTheProductRSge = (СтрЗапасы.Сумма + PerNetWeightReAllocation + PerGrossWeightReAllocation + PerPieceReAllocation + PercentOnPriceReAllocation) / ТекКоличество;
				Иначе
					СтрЗапасы.CostOfTheProductOur = 0;
					СтрЗапасы.CostOfTheProductRSge = 0;
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры
